{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Bus",
    "1": "Cobalt",
    "2": "Damas",
    "3": "Jiguli",
    "4": "Labo",
    "5": "Lasetti",
    "6": "Matiz",
    "7": "Nexia",
    "8": "Nexia3",
    "9": "Spark",
    "10": "unknown"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Bus": 0,
    "Cobalt": 1,
    "Damas": 2,
    "Jiguli": 3,
    "Labo": 4,
    "Lasetti": 5,
    "Matiz": 6,
    "Nexia": 7,
    "Nexia3": 8,
    "Spark": 9,
    "unknown": 10
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.52.4"
}
